bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90USB1287.xml
                <register caption="" name="UESTA0X" offset="0xEE" size="1">
                    <bitfield caption="" mask="0x80" name="CFGOK"/>
                    <bitfield caption="" mask="0x40" name="OVERFI"/>
                    <bitfield caption="" mask="0x20" name="UNDERFI"/>
                    <bitfield caption="" mask="0x0C" name="DTSEQ"/>
                    <bitfield caption="" mask="0x03" name="NBUSYBK"/>
                </register>
                <register caption="" name="UECFG1X" offset="0xED" size="1">
                    <bitfield caption="" mask="0x70" name="EPSIZE"/>
                    <bitfield caption="" mask="0x0C" name="EPBK"/>
                    <bitfield caption="" mask="0x02" name="ALLOC"/>
                </register>
                <register caption="" name="UECFG0X" offset="0xEC" size="1">
                    <bitfield caption="" mask="0xC0" name="EPTYPE"/>
                    <bitfield caption="" mask="0x01" name="EPDIR"/>
                </register>
                <register caption="" name="UECONX" offset="0xEB" size="1">
                    <bitfield caption="" mask="0x20" name="STALLRQ"/>
                    <bitfield caption="" mask="0x10" name="STALLRQC"/>
                    <bitfield caption="" mask="0x08" name="RSTDT"/>
                    <bitfield caption="" mask="0x01" name="EPEN"/>
                </register>
                <register caption="" name="UERST" offset="0xEA" size="1">
                    <bitfield caption="" mask="0x7F" name="EPRST"/>
                </register>
                <register caption="" name="UENUM" offset="0xE9" size="1" mask="0x07"/>
                <register caption="" name="UEINTX" offset="0xE8" size="1">
                    <bitfield caption="" mask="0x80" name="FIFOCON"/>
                    <bitfield caption="" mask="0x40" name="NAKINI"/>
                    <bitfield caption="" mask="0x20" name="RWAL"/>
                    <bitfield caption="" mask="0x10" name="NAKOUTI"/>
                    <bitfield caption="" mask="0x08" name="RXSTPI"/>
                    <bitfield caption="" mask="0x04" name="RXOUTI"/>
                    <bitfield caption="" mask="0x02" name="STALLEDI"/>
                    <bitfield caption="" mask="0x01" name="TXINI"/>
                </register>
                <register caption="" name="UDMFN" offset="0xE6" size="1" ocd-rw="R">
                    <bitfield caption="" mask="0x10" name="FNCERR"/>
                </register>
                <register caption="" name="UDFNUM" offset="0xE4" size="2" mask="0x07FF"/>
                <register caption="" name="UDADDR" offset="0xE3" size="1">
                    <bitfield caption="" mask="0x80" name="ADDEN"/>
                    <bitfield caption="" mask="0x7F" name="UADD"/>
                </register>
                <register caption="" name="UDIEN" offset="0xE2" size="1">
                    <bitfield caption="" mask="0x40" name="UPRSME"/>
                    <bitfield caption="" mask="0x20" name="EORSME"/>
                    <bitfield caption="" mask="0x10" name="WAKEUPE"/>
                    <bitfield caption="" mask="0x08" name="EORSTE"/>
                    <bitfield caption="" mask="0x04" name="SOFE"/>
                    <bitfield caption="" mask="0x01" name="SUSPE"/>
                </register>
                <register caption="" name="UDINT" offset="0xE1" size="1">
                    <bitfield caption="" mask="0x40" name="UPRSMI"/>
                    <bitfield caption="" mask="0x20" name="EORSMI"/>
                    <bitfield caption="" mask="0x10" name="WAKEUPI"/>
                    <bitfield caption="" mask="0x08" name="EORSTI"/>
                    <bitfield caption="" mask="0x04" name="SOFI"/>
                    <bitfield caption="" mask="0x01" name="SUSPI"/>
                </register>
                <register caption="" name="UDCON" offset="0xE0" size="1">
                    <bitfield caption="" mask="0x04" name="LSM"/>
                    <bitfield caption="" mask="0x02" name="RMWKUP"/>
                    <bitfield caption="" mask="0x01" name="DETACH"/>
                </register>
            </register-group>
        </module>
        <module caption="USB Controller" name="USB_GLOBAL">
            <register-group caption="USB Controller" name="USB_GLOBAL">
                <register caption="" name="OTGINT" offset="0xDF" size="1">
                    <bitfield caption="" mask="0x20" name="STOI"/>
                    <bitfield caption="" mask="0x10" name="HNPERRI"/>
                    <bitfield caption="" mask="0x08" name="ROLEEXI"/>
                    <bitfield caption="" mask="0x04" name="BCERRI"/>
                    <bitfield caption="" mask="0x02" name="VBERRI"/>
                    <bitfield caption="" mask="0x01" name="SRPI"/>
                </register>
                <register caption="" name="OTGIEN" offset="0xDE" size="1">
                    <bitfield caption="" mask="0x20" name="STOE"/>
                    <bitfield caption="" mask="0x10" name="HNPERRE"/>
                    <bitfield caption="" mask="0x08" name="ROLEEXE"/>
                    <bitfield caption="" mask="0x04" name="BCERRE"/>
                    <bitfield caption="" mask="0x02" name="VBERRE"/>
                    <bitfield caption="" mask="0x01" name="SRPE"/>
                </register>
                <register caption="" name="OTGCON" offset="0xDD" size="1">
                    <bitfield caption="" mask="0x20" name="HNPREQ"/>
                    <bitfield caption="" mask="0x10" name="SRPREQ"/>
                    <bitfield caption="" mask="0x08" name="SRPSEL"/>
                    <bitfield caption="" mask="0x04" name="VBUSHWC"/>
                    <bitfield caption="" mask="0x02" name="VBUSREQ"/>
                    <bitfield caption="" mask="0x01" name="VBUSRQC"/>
                </register>
                <register caption="" name="OTGTCON" offset="0xF9" size="1">
                    <bitfield caption="" mask="0x80" name="OTGTCON_7"/>
                    <bitfield caption="" mask="0x60" name="PAGE"/>
                    <bitfield caption="" mask="0x07" name="VALUE_2"/>
                </register>
                <register caption="" name="USBINT" offset="0xDA" size="1">
                    <bitfield caption="" mask="0x02" name="IDTI"/>
                    <bitfield caption="" mask="0x01" name="VBUSTI"/>
                </register>
