bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90USB1287.xml
                <register caption="" name="USBSTA" offset="0xD9" size="1" ocd-rw="R">
                    <bitfield caption="" mask="0x08" name="SPEED"/>
                    <bitfield caption="" mask="0x02" name="ID"/>
                    <bitfield caption="" mask="0x01" name="VBUS"/>
                </register>
                <register caption="USB General Control Register" name="USBCON" offset="0xD8" size="1">
                    <bitfield caption="" mask="0x80" name="USBE"/>
                    <bitfield caption="" mask="0x40" name="HOST"/>
                    <bitfield caption="" mask="0x20" name="FRZCLK"/>
                    <bitfield caption="" mask="0x10" name="OTGPADE"/>
                    <bitfield caption="" mask="0x02" name="IDTE"/>
                    <bitfield caption="" mask="0x01" name="VBUSTE"/>
                </register>
                <register caption="USB Hardware Configuration Register" name="UHWCON" offset="0xD7" size="1">
                    <bitfield caption="" mask="0x80" name="UIMOD"/>
                    <bitfield caption="" mask="0x40" name="UIDE"/>
                    <bitfield caption="" mask="0x10" name="UVCONE"/>
                    <bitfield caption="" mask="0x01" name="UVREGE"/>
                </register>
            </register-group>
        </module>
        <module caption="USB Host Registers" name="USB_HOST">
            <register-group caption="USB Host Registers" name="USB_HOST">
                <register caption="" name="UPERRX" offset="0xF5" size="1">
                    <bitfield caption="" mask="0x60" name="COUNTER"/>
                    <bitfield caption="" mask="0x10" name="CRC16"/>
                    <bitfield caption="" mask="0x08" name="TIMEOUT"/>
                    <bitfield caption="" mask="0x04" name="PID"/>
                    <bitfield caption="" mask="0x02" name="DATAPID"/>
                    <bitfield caption="" mask="0x01" name="DATATGL"/>
                </register>
                <register caption="" name="UPINT" offset="0xF8" size="1" mask="0x7F"/>
                <register caption="" name="UPBCHX" offset="0xF7" size="1" mask="0x07" ocd-rw="R"/>
                <register caption="" name="UPBCLX" offset="0xF6" size="1" mask="0xFF" ocd-rw="R"/>
                <register caption="" name="UPDATX" offset="0xAF" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="" name="UPIENX" offset="0xAE" size="1">
                    <bitfield caption="" mask="0x80" name="FLERRE"/>
                    <bitfield caption="" mask="0x40" name="NAKEDE"/>
                    <bitfield caption="" mask="0x10" name="PERRE"/>
                    <bitfield caption="" mask="0x08" name="TXSTPE"/>
                    <bitfield caption="" mask="0x04" name="TXOUTE"/>
                    <bitfield caption="" mask="0x02" name="RXSTALLE"/>
                    <bitfield caption="" mask="0x01" name="RXINE"/>
                </register>
                <register caption="" name="UPCFG2X" offset="0xAD" size="1" mask="0xFF"/>
                <register caption="" name="UPSTAX" offset="0xAC" size="1">
                    <bitfield caption="" mask="0x80" name="CFGOK"/>
                    <bitfield caption="" mask="0x40" name="OVERFI"/>
                    <bitfield caption="" mask="0x20" name="UNDERFI"/>
                    <bitfield caption="" mask="0x0C" name="DTSEQ"/>
                    <bitfield caption="" mask="0x03" name="NBUSYK"/>
                </register>
                <register caption="" name="UPCFG1X" offset="0xAB" size="1">
                    <bitfield caption="" mask="0x70" name="PSIZE"/>
                    <bitfield caption="" mask="0x0C" name="PBK"/>
                    <bitfield caption="" mask="0x02" name="ALLOC"/>
                </register>
                <register caption="" name="UPCFG0X" offset="0xAA" size="1">
                    <bitfield caption="" mask="0xC0" name="PTYPE"/>
                    <bitfield caption="" mask="0x30" name="PTOKEN"/>
                    <bitfield caption="" mask="0x0F" name="PEPNUM"/>
                </register>
                <register caption="" name="UPCONX" offset="0xA9" size="1">
                    <bitfield caption="" mask="0x40" name="PFREEZE"/>
                    <bitfield caption="" mask="0x20" name="INMODE"/>
                    <bitfield caption="" mask="0x08" name="RSTDT"/>
                    <bitfield caption="" mask="0x01" name="PEN"/>
                </register>
                <register caption="" name="UPRST" offset="0xA8" size="1">
                    <bitfield caption="" mask="0x7F" name="PRST"/>
                </register>
                <register caption="" name="UPNUM" offset="0xA7" size="1" mask="0x07"/>
                <register caption="" name="UPINTX" offset="0xA6" size="1">
                    <bitfield caption="" mask="0x80" name="FIFOCON"/>
                    <bitfield caption="" mask="0x40" name="NAKEDI"/>
                    <bitfield caption="" mask="0x20" name="RWAL"/>
                    <bitfield caption="" mask="0x10" name="PERRI"/>
                    <bitfield caption="" mask="0x08" name="TXSTPI"/>
                    <bitfield caption="" mask="0x04" name="TXOUTI"/>
                    <bitfield caption="" mask="0x02" name="RXSTALLI"/>
                    <bitfield caption="" mask="0x01" name="RXINI"/>
                </register>
                <register caption="" name="UPINRQX" offset="0xA5" size="1" mask="0xFF"/>
                <register caption="" name="UHFLEN" offset="0xA4" size="1" mask="0xFF"/>
                <register caption="" name="UHFNUM" offset="0xA2" size="2" mask="0x07FF"/>
                <register caption="" name="UHADDR" offset="0xA1" size="1" mask="0x7F"/>
                <register caption="" name="UHIEN" offset="0xA0" size="1">
                    <bitfield caption="" mask="0x40" name="HWUPE"/>
                    <bitfield caption="" mask="0x20" name="HSOFE"/>
                    <bitfield caption="" mask="0x10" name="RXRSME"/>
                    <bitfield caption="" mask="0x08" name="RSMEDE"/>
                    <bitfield caption="" mask="0x04" name="RSTE"/>
                    <bitfield caption="" mask="0x02" name="DDISCE"/>
                    <bitfield caption="" mask="0x01" name="DCONNE"/>
                </register>
                <register caption="" name="UHINT" offset="0x9F" size="1">
                    <bitfield caption="" mask="0x40" name="UHUPI"/>
                    <bitfield caption="" mask="0x20" name="HSOFI"/>
                    <bitfield caption="" mask="0x10" name="RXRSMI"/>
                    <bitfield caption="" mask="0x08" name="RSMEDI"/>
                    <bitfield caption="" mask="0x04" name="RSTI"/>
                    <bitfield caption="" mask="0x02" name="DDISCI"/>
                    <bitfield caption="" mask="0x01" name="DCONNI"/>
                </register>
                <register caption="" name="UHCON" offset="0x9E" size="1">
                    <bitfield caption="" mask="0x04" name="RESUME"/>
                    <bitfield caption="" mask="0x02" name="RESET"/>
                    <bitfield caption="" mask="0x01" name="SOFEN"/>
                </register>
            </register-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
