bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/AT90USB1287.xml
                <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
                    <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS"
                              values="ANALOG_ADC_AUTO_TRIGGER2"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
                    <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
                    <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
                    <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
                    <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
                    <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
                    <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
                    <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF2">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03"
                       value="0x03"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER2">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                </register>
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Phase Locked Loop" name="PLL">
            <register-group caption="Phase Locked Loop" name="PLL">
                <register caption="PLL Status and Control register" name="PLLCSR" offset="0x49" size="1">
                    <bitfield caption="PLL prescaler Bits" mask="0x1C" name="PLLP" values="PLL_INPUT_PRESCALER"/>
                    <bitfield caption="PLL Enable Bit" mask="0x02" name="PLLE"/>
                    <bitfield caption="PLL Lock Status Bit" mask="0x01" name="PLOCK"/>
                </register>
            </register-group>
            <value-group caption="" name="PLL_INPUT_PRESCALER">
                <value caption="Clock/4" name="VAL_0x03" value="0x03"/>
                <value caption="Clock/8" name="VAL_0x05" value="0x05"/>
            </value-group>
        </module>
    </modules>
</target-description-file>
